[
	{
		"id": "1",
		"title": "Ciné Crew (WOP)",
		"mission": "Projet personnel initié en parallèlle de ma formation. Il est encore en cours de développement. Mon objectif est de créer entièrement un site de notation de films incluant des fonctions sociales. Actuellement, j'ai intégré un moteur de recherche ainsi qu'une interface d'affichage pour les films. Je suis en train de me former sur le langage SQL pour développer le backend du site, nécessaire à l'intégration des fonctions sociales.",
        "technologies": [
			"REACT",
			"CSS",
			"SQL",
			"API_TMDB"
		],
		"github": "https://github.com/Msgau/site_cine"
	},
    {
		"id": "2",
		"title": "Frontend du site KASA",
		"mission": "Créer l'interace visuelle d'un site de réservation de logements chez l'habitant avec React. C'est avec ce projet que je me suis formé aux bases du framework React. J'ai utilisé des composants pour générer la page d'accueil qui présente la liste des logements, puis pour créer une page présentant la fiche d'un logement. Réalisé dans le cadre de ma formation.",
        "technologies": [
			"REACT",
			"CSS"
		],
		"github": "https://github.com/Msgau/kasa"
	},
    {
		"id": "3",
		"title": "Mon Vieux Grimoire (backend)",
		"mission": "Construire le backend du site Mon Vieux Grimoire, un site de notation de livres. J'ai utilisé express et node.js pour créer la structure du backend du site, en m'appuyant sur la base de données noSQL mongoDB. J'ai pu créer des routes sécurisées pour que les utilisateurs puissent créer un compte, se connecter, ajouter un livre, le noter, le modifier ou le supprimer, et enfin pour afficher les objets créés par ceux-ci. Réalisé dans le cadre de ma formation.",
        "technologies": [
			"NodeJs",
			"Express",
			"MongoDB",
			"JsonWebToken"
		],
		"github": "https://github.com/Msgau/Projet-7-openclassrooms-Mon-vieux-grimoire"
	},
    {
		"id": "4",
		"title": "Nina Carducci (optimisation, débug)",
		"mission": "Je suis parti d'un site déjà conçu par un autre développeur, mais présentant des problèmes : performances, référencement, ainsi que des bugs sur ses fonctionnalités Par exemple, la fonction de tri de la galerie. J'ai entrepris d'améliorer le référencement et les performances du site, débugger les outils qui ne fonctionnent pas, supprimer le code inutile des bibliothèques, ou bien le remplacer par du code JavaScript. Réalisé dans le cadre de ma formation.",
        "technologies": [
			"HTML",
			"CSS",
			"JavaScript",
			"Lighthouse"
		],
		"github": "https://github.com/Msgau/Projet-5-openclassrooms",
		"link": "https://msgau.github.io/Projet-5-openclassrooms/"
	}
]